app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT `authors`.* FROM `authors`

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO `authors` (`email`, `alias`, `created_at`, `updated_at`) VALUES ('nathan.noble@gmail.com', 'nathan', '2015-11-14 00:26:51.170983', '2015-11-14 00:26:51.170983')

    def set_author
      @author = Author.find(params[:id])
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1