app/controllers/questions_controller.rb

  def index
    @questions = Question.order(id: :desc).paginate(:page => params[:page], :per_page => 4)
---
SELECT  `questions`.* FROM `questions`  ORDER BY `questions`.`id` DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM `questions`

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO `questions` (`title`, `answer`, `author_id`, `created_at`, `updated_at`) VALUES ('Guess what this item is', 'yellow bird', 1, '2015-11-14 00:30:42.459856', '2015-11-14 00:30:42.459856')

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE `questions` SET `answer` = 'yellow birdy', `updated_at` = '2015-11-14 00:31:33.809236' WHERE `questions`.`id` = 1

    def set_question
      @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1